In [1]:
import pandas as pd

In [2]:
data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

In [3]:
accounts

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91796

Write a solution to calculate the number of bank accounts for each salary category. The salary categories are:

* "Low Salary": All the salaries strictly less than $20000.
* "Average Salary": All the salaries in the inclusive range [$20000, $50000].
* "High Salary": All the salaries strictly greater than $50000.

The result table must contain all three categories. If there are no accounts in a category, return 0.

Return the result table in any order.

The result format is in the following example.

| category       | accounts_count |
|----------------|----------------|
| Low Salary     | 1              |
| Average Salary | 0              |
| High Salary    | 3              |

In [12]:
low=accounts.loc[accounts.income < 20000].shape[0]
avg=accounts.loc[(accounts.income >= 20000) & (accounts.income <= 50000)].shape[0]
hi=accounts.loc[accounts.income > 50000].shape[0]
print(f'{low} {avg} {hi}')

1 0 3

In [13]:
pd.DataFrame(data=[
        ["Low Salary",low],
        ["Average Salary",avg],
        ["High Salary",hi],
    ],
    columns=["category","accounts_count"]
)

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3